{"posts":[{"title":"Hello world (again)","text":"I am once again deciding to set up a personal site, domain (while it’s still available), and blog. I realized I’ve been putting up content on the web as early as 2008/09, and it’s been a while since I’ve had a place to put up my thoughts and work in a more organized manner. I have a feeling it’ll be a mix of thoughts, musings and ideas centered around tech, AI, product, design, entrepreneurship - but I’m letting this evolve over time and let’s see where it goes. Hexo wasn’t that hard to set up, and this theme was beautiful. The comment system from utteranc.es is pretty good, but it’ll bias comments towards GitHub users. I’ll try this out first.","link":"/2024/03/18/hello-world/"}],"tags":[{"name":"meta","slug":"meta","link":"/tags/meta/"}],"categories":[],"pages":[{"title":"Joel Huang","text":"About meI had a fortunate few years as a curious kid in the late 90s before tech took over - drawing dinosaurs daily, building craft projects every week, catching spiders in bushes and building them homes made of plastic staple boxes, gluing chunks of staples to build rooms, ramps, and gates within (terrible!). By the turn of the millennium I was running tabletop games at school (without knowing what that was), building and publishing blog skins, modding handheld games, and running (legally suspect) private servers for friends to experience games in ways they otherwise wouldn’t be able to. I was sure I was going to be a game designer, then a geographer, then an architect… … I ended up reading CS and AI 🙄, which gave me new tools to make more stuff people love. This part of me will stay. Startup lifeI now lead work on AI and product at Bifrost, a Series A startup building 3D virtual worlds as sandboxes for AI. To put it simply, it’s like shoving you (the AI) in the Matrix and simulating many possible scenarios so you know what to expect, and having you validate those newfound skills in the real world. The LinkedIn spew is: I work on AI research, inventing synthetic data workflows, turning research into product, product strategy, data-centric MLOps/CVOps workflow and tooling, engineering ops, hiring and teambuilding, AI consultancy, content strategy, and more good stuff. Our product goal is to allow users to create programmable 3D worlds easily so they can train and test AI systems properly. This isn’t as easy as it sounds, chiefly because: (i) humans are notoriously bad at specification (think how bad we are at prompting), (ii) abstraction and control are at odds, (iii) 3D is still a mess, and (iv) AI is difficult to control. Technically, our stack is monstrously complex. To do this, we had to develop expertise across highly fragmented 3D tooling, build AI models, tools, and data engines to generate and test realistic and performant data, and write custom software for orchestration and scale. But at the end of the day, the more wicked the problems, the more value there is in solving them. I’m fortunate to work alongside brilliant minds who agree, and to be backed by the likes of Sequoia, Wavemaker, Lux, Carbide, and other wonderful investors. Education and workI graduated with a Computer Science degree from Singapore University of Technology and Design, and a master’s degree in AI from the National University of Singapore. Before Bifrost, I worked on computer vision and machine learning research with orgs like Singtel, Nvidia, and NUS. Other things I enjoyI picked up bouldering more seriously in Sept ‘23, wore out my first pair of shoes in 3 months, and continue to climb ~once a week. In a previous life, I dabbled in music performance, digital music and sound synthesis. Built software for a gesture-control armband to produce music live. Last played keys/synthesizer for BGourd and Spacecrumbs. I’m trying to restore an attention span damaged by content engines and regulate my information diet. I enjoy reading non-fiction - recently it’s been about models of reality, design principles, and scaling laws. I’m also experimenting lightly with remote work, particularly in how to build and run remote-first teams and develop meaningful connections with people on the other side of that screen. ContactYou’re welcome to reach out on LinkedIn or Twitter for professional matters. For personal matters, do reach me via Telegram or email.","link":"/index.html"}]}